Week 5 - Wednesday Questions

1. List all customers with their address who live in Texas (use JOINs)

In [ ]:
SELECT c.first_name, c.last_name, a.address 
FROM customer c
JOIN address a ON c.address_id = a.address_id
WHERE a.district = 'Texas';

2. List all payments of more than $7.00 with the customerâ€™s first and last name

In [ ]:
-- To return all customer payments over $7
SELECT c.first_name, c.last_name, p.amount
FROM payment p
JOIN customer c ON p.customer_id = c.customer_id 
WHERE p.amount > 7
GROUP BY c.first_name, c.last_name, p.amount;
-- Example of adding in a last name to the where clause 
SELECT c.first_name, c.last_name, p.amount
FROM payment p
JOIN customer c ON p.customer_id = c.customer_id 
WHERE p.amount > 7 AND last_name = 'Bates'
GROUP BY c.first_name, c.last_name, p.amount;
-- Returns 3 payments made by Daisy Bates over $7

3. Show all customer names who have made over $175 in payments (use
subqueries)

In [ ]:
-- First made my inner query to test that I could grab the customer_id's of customers
-- with payments over $175
SELECT customer_id
FROM payment
GROUP BY customer_id 
HAVING sum(amount) > 175

-- Made outer query and pasted inner query in 

SELECT first_name, last_name, 
FROM customer
WHERE customer_id IN (
	SELECT customer_id
	FROM payment
	GROUP BY customer_id 
	HAVING sum(amount) > 175
    );

-- This returns: 
-- ===============================
-- Rhonda  Kennedy	
-- Clara   Shaw	
-- Eleanor Hunt	
-- Marion  Snyder	
-- Tommy   Collazo	
-- Karl	   Seal

4. List all customers that live in Argentina (use multiple joins)

In [ ]:
SELECT *
FROM address a 
JOIN customer b ON a.address_id = b.address_id 
JOIN city c ON a.city_id = c.city_id 
JOIN country d ON c.city_id = d.country_id 
WHERE d.country = 'Argentina';

-- Returns 
-- Addis Abeba along with all his information

5. Show all the film categories with their count in descending order

In [ ]:
SELECT count(film_id) film_count, c.name
FROM film_category fc
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name  
ORDER BY film_count DESC 

-- Returns
-- 74	Sports
-- 73	Foreign
-- 69	Family
-- 68	Documentary
-- 66	Animation
-- 64	Action
-- 63	New
-- 62	Drama
-- 61	Sci-Fi
-- 61	Games
-- 60	Children
-- 58	Comedy
-- 57	Travel
-- 57	Classics
-- 56	Horror
-- 51	Music

6. What film had the most actors in it (show film info)?

In [ ]:
SELECT f.title, count(fa.actor_id) cfa 
FROM film_actor fa 
JOIN film f ON fa.film_id  = f.film_id 
GROUP BY f.title 
ORDER BY cfa DESC 
LIMIT 1;

-- Returns
-- Lambs Cincinatti	15

7. Which actor has been in the least movies?

In [ ]:
SELECT a.first_name, a.last_name, count(a.actor_id) ac
FROM actor a 
JOIN film_actor fa ON a.actor_id = fa.actor_id 
GROUP BY first_name, last_name 
ORDER BY ac ASC 
LIMIT 1;
-- Returns
-- Emily	Dee	14

8. Which country has the most cities?

In [ ]:
SELECT c.country, count(cc.city_id) ccid 
FROM country c 
JOIN city cc ON c.country_id = cc.country_id 
GROUP BY c.country 
ORDER BY ccid DESC 
LIMIT 1;

-- Returns
-- India 60

9. List the actors who have been in between 20 and 25 films.

In [ ]:
SELECT a.first_name, a.last_name, count(a.actor_id) movie_count
FROM actor a 
JOIN film_actor fa ON a.actor_id = fa.actor_id 
GROUP BY first_name, last_name 
HAVING count(a.actor_id ) BETWEEN 20 AND 25 


-- Returns (only a few of the results )
-- Minnie	Kilmer	    20
-- Liza	     Bergman	25
-- Michelle	 Mcconaughey23
-- Burt	     Temple	    23
-- Morgan	 Mcdormand	25
-- Kevin	 Bloom	    21
-- Rita	     Reynolds	20
-- Burt	     Posey	    24
-- Meryl	 Allen	    22
-- Nick	     Wahlberg	25
-- Cuba	     Birch	    24
-- Tom	     Mckellen	25
-- Adam	     Hopper	    22
-- Tim	     Hackman	23
-- Milla	 Peck	    24
-- Christopher West	    21
-- Lisa	     Monroe	    23